(defvar *mbr-struct* #(0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 ;; код загрузчика
                       128 ;; раздел занят
                       0 0 0
                       12 ;; тип файловой системы FAT32
                       0 0 0
                       1 0 0 0 ;; первый сектор
                       250 0 0 0 ;; количество секторов
                       128 ;; раздел занят
                       0 0 0
                       148 ;; тип файловой системы ISO9660(CDFS)
                       0 0 0
                       251 0 0 0 ;; первый сектор
                       250 0 0 0 ;; количество секторов
                       0 ;; раздел свободен
                       0 0 0
                       0
                       0 0 0
                       0 0 0 0
                       0 0 0 0
                       0
                       0 0 0
                       0
                       0 0 0
                       0 0 0 0
                       0 0 0 0
                       0xAA 0x55))

(deftest parse-partition-rec-test () "parse partition rec test"
         "Проверка парсинга структуры элемента таблицы разделов в mbr"
         (let ((partition #(128 ;; раздел занят
                            0 0 0
                            12 ;; тип файловой системы FAT32
                            0 0 0
                            1 0 0 0 ;; первый сектор
                            250 0 0 0 ))) ;; количество секторов
           (setq *disk* 5)
           (assert
            (car (funcall (parse-partition-rec) (stream-from-arr partition nil)))
            (list 5 1 250))))

(deftest load-partition-test () "load partition test"
         "Проверка загрузки раздела"
         (setq *disk* 0)
         (ata-write-sectors 0 0 1 *mbr-struct*)
         (assert
          (load-partition *disk* 1)
          (list 0 251 250)))
